package com.study.leetcode.August;
/**
 * @author c
 * @date 2022/8/9 10:03
 */
public class T1413_逐步求和得到正数的最小值 {
    /*
    难度：简单
    --------------------------------------------------------------------------------
    题目：
        给你一个整数数组 nums 。你可以选定任意的 正数 startValue 作为初始值。

        你需要从左到右遍历 nums 数组，并将 startValue 依次累加上 nums 数组中的值。

        请你在确保累加和始终大于等于 1 的前提下，选出一个最小的 正数 作为 startValue 。

    --------------------------------------------------------------------------------
    解题思路：简单模拟题
        根据题意，我们直接找到前缀和的最小值，然后取最小值的相反数+1即可
    --------------------------------------------------------------------------------
     */

    public int minStartValue(int[] nums) {
        int sum = 0, min = 0;
        for (int num : nums) {
            sum += num;
            min = Math.min(min, sum);
        }
        return -min + 1;
    }

}
