package com.study.leetcode.template;
/**
 * @author c
 * 2022/7/29
 */
public class IDEA答题模板 {

     /*
    --------------------------------------------------------------------------------
    题目：
        给定2D空间中四个点的坐标 p1, p2, p3 和 p4，如果这四个点构成一个正方形，则返回 true 。

        点的坐标 pi 表示为 [xi, yi] 。输入 不是 按任何顺序给出的。

        一个 有效的正方形 有四条等边和四个等角(90度角)。
    --------------------------------------------------------------------------------

    解题思路：
      该图形是正方形，那么点和点的距离只有两种结果，边长和对角线，且对角线是边长的根号2倍，我们用此条件作为判断。
    --------------------------------------------------------------------------------
     */

}
