package com.study.leetcode.oneQuestionPerDay;

/**
 * @author c
 * @date 2022/10/3 14:51
 */
public class T1784_检查二进制字符串字段 {
    /*
    难度：easy
    --------------------------------------------------------------------------------
    题目：
        给你一个二进制字符串 s ，该字符串 不含前导零 。

        如果 s 包含 零个或一个由连续的 '1' 组成的字段 ，返回 true​​​ 。否则，返回 false 。

        如果 s 中 由连续若干个 '1' 组成的字段 数量不超过 1，返回 true​​​ 。否则，返回 false 。

    --------------------------------------------------------------------------------
    解题思路：

    --------------------------------------------------------------------------------
     */

    public boolean checkOnesSegment(String s) {
        return !s.contains("01");
    }
}
