package com.study.leetcode.oneQuestionPerDay;

public class T2485_找出中枢整数 {
    /*
    --------------------------------------------------------------------------------
    题目：
      给你一个正整数 n ，找出满足下述条件的 中枢整数 x ：
            1 和 x 之间的所有元素之和等于 x 和 n 之间所有元素之和。
      返回中枢整数 x 。如果不存在中枢整数，则返回 -1 。题目保证对于给定的输入，至多存在一个中枢整数。
    --------------------------------------------------------------------------------

    解题思路：

    --------------------------------------------------------------------------------
     */

    public int pivotInteger(int n) {
        for (int x = 1; x <= n; ++x) {
            if (((1+x) * x) == (x + n) * (n - x + 1)){
                return x;
            }
        }
        return -1;
    }

}
